//1. З клавіатури вводяться числа до тих пір, поки послідовність є
//монотонною (зростаючою або спадною).

var a = prompt("Введіть число: ");
var b = prompt("Введіть число: ");
if(a < b){
	while (a < b){
		a = b;
		b = prompt("Введіть число: ");
	}
}
else{
	while (a > b){
		a = b;
		b = prompt("Введіть число: ");
	}
}

//2. Знайти суму цифр числа, що знаходяться між першою цифрою та
//останньою цифрою.

var a = Number(prompt("Введіть число: "));
var result = 0;
a = Math.floor(a/10);
while(`${a}`.length > 1){
	result += a % 10;
	a = Math.floor(a/10);
}
console.log(result);

//4. Необхідно підсумовувати всі непарні цілі числа в діапазоні, який
//користувач введе з клавіатури.

var a = prompt("Введіть першу границю: ");
var b = prompt("Введіть другу границю: ");
var result = 0;
for(a; a < b; a++){
	if(a % 2 != 1){
		if(Number.isInteger(a)){
			result += a;
		}
	}
}
console.log(result);

// 6. Написати програму, яка показуватиме на екран квадрат числа, введеного
// користувачем. Користувач повинен сам вирішувати – вийти із програми або
// продовжити введення.

var i = 1;
while (i == 1){
	var a = prompt("number =");
	alert(a**2);
	var p = prompt("1(yes) or 0(no)?")
	if (p == 0){
		break;
	}
}

// 30. З клавіатури вводяться числа і підсумовуються. Знайти кількість
// введених чисел, коли їхня сума перевищила 100.

var result = 0;
var i = 0;
while(result < 100){
	result += Number(prompt("number = "));
	i++
}
console.log(i)